## Analytic Functions – Ranking

Let us see how we can assign ranks using different **rank** functions.

* If we have to assign ranks globally, we just need to specify **ORDER BY**
* If we have to assign ranks with in a key then we need to specify **PARTITION BY** and then **ORDER BY**.
* By default **ORDER BY** will sort the data in ascending order. We can change the order by passing **DESC** after order by.
* We have 3 main functions to assign ranks - `rank`, `dense_rank` and `row_number`. We will see the differences between the 3 in a moment.

In [19]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [20]:
%env DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

env: DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

```{note}
Here is an example to assign sparse ranks using daily_product_revenue with in each day based on revenue.
```

In [21]:
%%sql

SELECT t.*,
    rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) AS rnk
FROM daily_product_revenue t
ORDER BY order_date, revenue DESC
LIMIT 30

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
30 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 2),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 3),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 4),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 5),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 6),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 7),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 8),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 9),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 10),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96'), 11),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96'), 12),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'), 13),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99'), 14),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97'), 15),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99'), 16),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00'), 17),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00'), 18),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96'), 19),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97'), 20),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96'), 21),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95'), 22),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95'), 22),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97'), 24),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'), 25),
 (datetime.datetime(2013, 7, 25, 0, 0), 897, Decimal('49.98'), 26),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 1),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 2),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 3),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 4)]

```{note}
Here is another example to assign sparse ranks using employees data set with in each department. Make sure to restart kernel as you might have connected to retail database.
```

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://itversity_hr_user:hr_password@localhost:5432/itversity_hr_db

env: DATABASE_URL=postgresql://itversity_hr_user:hr_password@localhost:5432/itversity_hr_db

In [3]:
%%sql

SELECT employee_id, department_id, salary FROM employees 
ORDER BY department_id,
    salary DESC
LIMIT 10

10 rows affected.

[(200, 10, Decimal('4400.00')),
 (201, 20, Decimal('13000.00')),
 (202, 20, Decimal('6000.00')),
 (114, 30, Decimal('11000.00')),
 (115, 30, Decimal('3100.00')),
 (116, 30, Decimal('2900.00')),
 (117, 30, Decimal('2800.00')),
 (118, 30, Decimal('2600.00')),
 (119, 30, Decimal('2500.00')),
 (203, 40, Decimal('6500.00'))]

In [4]:
%%sql

SELECT employee_id, department_id, salary,
    rank() OVER (
        PARTITION BY department_id 
        ORDER BY salary DESC
    ) AS rnk
FROM employees
LIMIT 20

 * postgresql://itversity_hr_user:***@localhost:5432/itversity_hr_db
20 rows affected.

[(200, 10, Decimal('4400.00'), 1),
 (201, 20, Decimal('13000.00'), 1),
 (202, 20, Decimal('6000.00'), 2),
 (114, 30, Decimal('11000.00'), 1),
 (115, 30, Decimal('3100.00'), 2),
 (116, 30, Decimal('2900.00'), 3),
 (117, 30, Decimal('2800.00'), 4),
 (118, 30, Decimal('2600.00'), 5),
 (119, 30, Decimal('2500.00'), 6),
 (203, 40, Decimal('6500.00'), 1),
 (121, 50, Decimal('8200.00'), 1),
 (120, 50, Decimal('8000.00'), 2),
 (122, 50, Decimal('7900.00'), 3),
 (123, 50, Decimal('6500.00'), 4),
 (124, 50, Decimal('5800.00'), 5),
 (184, 50, Decimal('4200.00'), 6),
 (185, 50, Decimal('4100.00'), 7),
 (192, 50, Decimal('4000.00'), 8),
 (193, 50, Decimal('3900.00'), 9),
 (188, 50, Decimal('3800.00'), 10)]

```{note}
Here is an example to assign dense ranks using employees data set with in each department.
```

In [5]:
%%sql

SELECT employee_id, department_id, salary,
    dense_rank() OVER (
        PARTITION BY department_id 
        ORDER BY salary DESC
    ) AS drnk
FROM employees
LIMIT 20

 * postgresql://itversity_hr_user:***@localhost:5432/itversity_hr_db
20 rows affected.

[(200, 10, Decimal('4400.00'), 1),
 (201, 20, Decimal('13000.00'), 1),
 (202, 20, Decimal('6000.00'), 2),
 (114, 30, Decimal('11000.00'), 1),
 (115, 30, Decimal('3100.00'), 2),
 (116, 30, Decimal('2900.00'), 3),
 (117, 30, Decimal('2800.00'), 4),
 (118, 30, Decimal('2600.00'), 5),
 (119, 30, Decimal('2500.00'), 6),
 (203, 40, Decimal('6500.00'), 1),
 (121, 50, Decimal('8200.00'), 1),
 (120, 50, Decimal('8000.00'), 2),
 (122, 50, Decimal('7900.00'), 3),
 (123, 50, Decimal('6500.00'), 4),
 (124, 50, Decimal('5800.00'), 5),
 (184, 50, Decimal('4200.00'), 6),
 (185, 50, Decimal('4100.00'), 7),
 (192, 50, Decimal('4000.00'), 8),
 (193, 50, Decimal('3900.00'), 9),
 (188, 50, Decimal('3800.00'), 10)]

```{note}
Here is an example for global rank based on salary. If all the salaries are unique, we can use `LIMIT` but when they are not unique, we have to go with analytic functions.
```

In [6]:
%%sql

SELECT employee_id, department_id, salary,
    rank() OVER (
        ORDER BY salary DESC
    ) AS rnk,
    dense_rank() OVER (
        ORDER BY salary DESC
    ) AS drnk
FROM employees
LIMIT 20

 * postgresql://itversity_hr_user:***@localhost:5432/itversity_hr_db
20 rows affected.

[(100, 90, Decimal('24000.00'), 1, 1),
 (101, 90, Decimal('17000.00'), 2, 2),
 (102, 90, Decimal('17000.00'), 2, 2),
 (145, 80, Decimal('14000.00'), 4, 3),
 (146, 80, Decimal('13500.00'), 5, 4),
 (201, 20, Decimal('13000.00'), 6, 5),
 (205, 110, Decimal('12000.00'), 7, 6),
 (147, 80, Decimal('12000.00'), 7, 6),
 (108, 100, Decimal('12000.00'), 7, 6),
 (168, 80, Decimal('11500.00'), 10, 7),
 (148, 80, Decimal('11000.00'), 11, 8),
 (174, 80, Decimal('11000.00'), 11, 8),
 (114, 30, Decimal('11000.00'), 11, 8),
 (149, 80, Decimal('10500.00'), 14, 9),
 (162, 80, Decimal('10500.00'), 14, 9),
 (169, 80, Decimal('10000.00'), 16, 10),
 (204, 70, Decimal('10000.00'), 16, 10),
 (150, 80, Decimal('10000.00'), 16, 10),
 (156, 80, Decimal('10000.00'), 16, 10),
 (170, 80, Decimal('9600.00'), 20, 11)]

Let us understand the difference between **rank**, **dense_rank** and **row_number**.

* We can use either of the functions to generate ranks when the rank field does not have duplicates.
* When rank field have duplicates then row_number should not be used as it generate unique number for each record with in the partition.
* **rank** will skip the ranks in between if multiple people get the same rank while **dense_rank** continue with the next number.

In [7]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
%env DATABASE_URL=postgresql://itversity_hr_user:hr_password@localhost:5432/itversity_hr_db

env: DATABASE_URL=postgresql://itversity_hr_user:hr_password@localhost:5432/itversity_hr_db

In [9]:
%%sql

SELECT
    employee_id,
    department_id,
    salary,
    rank() OVER (
        PARTITION BY department_id
        ORDER BY salary DESC
      ) rnk,
    dense_rank() OVER (
        PARTITION BY department_id
        ORDER BY salary DESC
      ) drnk,
    row_number() OVER (
        PARTITION BY department_id
        ORDER BY salary DESC, employee_id
      ) rn
FROM employees
ORDER BY department_id, salary DESC
LIMIT 50

 * postgresql://itversity_hr_user:***@localhost:5432/itversity_hr_db
50 rows affected.

[(200, 10, Decimal('4400.00'), 1, 1, 1),
 (201, 20, Decimal('13000.00'), 1, 1, 1),
 (202, 20, Decimal('6000.00'), 2, 2, 2),
 (114, 30, Decimal('11000.00'), 1, 1, 1),
 (115, 30, Decimal('3100.00'), 2, 2, 2),
 (116, 30, Decimal('2900.00'), 3, 3, 3),
 (117, 30, Decimal('2800.00'), 4, 4, 4),
 (118, 30, Decimal('2600.00'), 5, 5, 5),
 (119, 30, Decimal('2500.00'), 6, 6, 6),
 (203, 40, Decimal('6500.00'), 1, 1, 1),
 (121, 50, Decimal('8200.00'), 1, 1, 1),
 (120, 50, Decimal('8000.00'), 2, 2, 2),
 (122, 50, Decimal('7900.00'), 3, 3, 3),
 (123, 50, Decimal('6500.00'), 4, 4, 4),
 (124, 50, Decimal('5800.00'), 5, 5, 5),
 (184, 50, Decimal('4200.00'), 6, 6, 6),
 (185, 50, Decimal('4100.00'), 7, 7, 7),
 (192, 50, Decimal('4000.00'), 8, 8, 8),
 (193, 50, Decimal('3900.00'), 9, 9, 9),
 (188, 50, Decimal('3800.00'), 10, 10, 10),
 (137, 50, Decimal('3600.00'), 11, 11, 11),
 (189, 50, Decimal('3600.00'), 11, 11, 12),
 (141, 50, Decimal('3500.00'), 13, 12, 13),
 (186, 50, Decimal('3400.00'), 14, 13, 14),
 (129, 50, Decimal('3300.00'), 15, 14, 15),
 (133, 50, Decimal('3300.00'), 15, 14, 16),
 (125, 50, Decimal('3200.00'), 17, 15, 17),
 (138, 50, Decimal('3200.00'), 17, 15, 18),
 (180, 50, Decimal('3200.00'), 17, 15, 19),
 (194, 50, Decimal('3200.00'), 17, 15, 20),
 (142, 50, Decimal('3100.00'), 21, 16, 21),
 (181, 50, Decimal('3100.00'), 21, 16, 22),
 (196, 50, Decimal('3100.00'), 21, 16, 23),
 (187, 50, Decimal('3000.00'), 24, 17, 24),
 (197, 50, Decimal('3000.00'), 24, 17, 25),
 (134, 50, Decimal('2900.00'), 26, 18, 26),
 (190, 50, Decimal('2900.00'), 26, 18, 27),
 (130, 50, Decimal('2800.00'), 28, 19, 28),
 (183, 50, Decimal('2800.00'), 28, 19, 29),
 (195, 50, Decimal('2800.00'), 28, 19, 30),
 (126, 50, Decimal('2700.00'), 31, 20, 31),
 (139, 50, Decimal('2700.00'), 31, 20, 32),
 (143, 50, Decimal('2600.00'), 33, 21, 33),
 (198, 50, Decimal('2600.00'), 33, 21, 34),
 (199, 50, Decimal('2600.00'), 33, 21, 35),
 (131, 50, Decimal('2500.00'), 36, 22, 36),
 (140, 50, Decimal('2500.00'), 36, 22, 37),
 (144, 50, Decimal('2500.00'), 36, 22, 38),
 (182, 50, Decimal('2500.00'), 36, 22, 39),
 (191, 50, Decimal('2500.00'), 36, 22, 40)]

```{note}
Here is another example to with respect to all 3 functions. Make sure to restart kernel as you might have connected to HR database.
```

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

env: DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

In [3]:
%%sql

SELECT
    t.*,
    rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) rnk,
    dense_rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) drnk,
    row_number() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) rn
FROM daily_product_revenue AS t
ORDER BY order_date, revenue DESC
LIMIT 30

30 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1, 1, 1),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 2, 2, 2),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 3, 3, 3),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 4, 4, 4),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 5, 5, 5),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 6, 6, 6),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 7, 7, 7),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 8, 8, 8),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 9, 9, 9),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 10, 10, 10),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96'), 11, 11, 11),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96'), 12, 12, 12),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'), 13, 13, 13),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99'), 14, 14, 14),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97'), 15, 15, 15),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99'), 16, 16, 16),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00'), 17, 17, 17),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00'), 18, 18, 18),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96'), 19, 19, 19),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97'), 20, 20, 20),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96'), 21, 21, 21),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95'), 22, 22, 22),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95'), 22, 22, 23),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97'), 24, 23, 24),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'), 25, 24, 25),
 (datetime.datetime(2013, 7, 25, 0, 0), 897, Decimal('49.98'), 26, 25, 26),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 1, 1, 1),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 2, 2, 2),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 3, 3, 3),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 4, 4, 4)]